c4tachan/digi-dash/firmware/sdkconfig.defaults
# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Enable PSRAM for frame buffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
